Revit 2024 API
IPipeFittingAndAccessoryPressureDropServer Interface
 Interface class for external servers implementing pipe fitting and pipe accessory coefficient calculation.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public interface IPipeFittingAndAccessoryPressureDropServer : IExternalServer
Visual Basic
Public Interface IPipeFittingAndAccessoryPressureDropServer _
	Inherits IExternalServer
Visual C++
public interface class IPipeFittingAndAccessoryPressureDropServer : IExternalServer
Remarks
 A typical way to use the external server can be:
Implement a server class that derives from this interface
Create a new server object and register it with the service, see ExternalServiceRegistry.
Assign server to pipe fitting instance.
See Also
IPipeFittingAndAccessoryPressureDropServer Members
Autodesk.Revit.DB.Plumbing Namespace